{
  "nav": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "contact": "Contact"
  },
  "home": {
    "greeting": "HELLO",
    "iam": "I'm Kevin.",
    "role": "Junior Full Stack Developer",
    "btnProject": "I have a Project",
    "btnCV": "My Resume"
  },
  "about": {
    "title": "About Me",
    "p1": "Hi 👋, I'm Kevin Pillaca, passionate about technology and trained in <span>Computer and Systems Engineering</span>. My journey began in the world of graphic design and technical support, where I discovered how much I enjoy creating practical solutions and adding value to real-world problems.",
    "p2": "Over time, graphic design sparked my interest in <span>interface design</span>, so I started creating prototypes in Figma, gaining a deeper understanding of the importance of user experience in a project.",
    "p3": "From there, I decided to move forward and fully dive into <span>web development</span>. I started with <span>HTML, CSS and JavaScript</span>, and since then I have developed real websites for clients, which strengthened my experience and motivated me to keep growing.",
    "p4": "This process led me to specialize as a <span>Full Stack Developer</span>, currently working with <span>Angular, Node.js, Express, TypeScript and MySQL</span>, developing <span>REST APIs</span> for communication between <span>frontend</span> and <span>backend</span>, always aiming to build useful and well-structured solutions 🚀.",
    "p5": "When I'm not coding, I enjoy sports, especially soccer ⚽, and spending time with my family, which is my greatest motivation. I'm ready to keep growing professionally, take on new challenges, and build amazing things with code ☕.",
    "question": "Shall we talk code and build something amazing?",
    "skills": "Skills",
    "frontend": "Frontend Technologies",
    "backend": "Backend Technologies",
    "tools": " Other Tools... "
  },
  "projects": {
    "title": "Projects",
    "description": "Explore some of the solutions I have recently built.",
    "webTitle": "Website",
    "webDesc": "Website developed for a graphic printing company, focused on presenting its printing services in a clear and visually appealing way. It facilitates direct contact with clients and strengthens the business's professional digital presence.",
    "appTitle": "Print Management",
    "inProgress": "(in development - 60%)",
    "appDesc": "Web application designed to replace manual management in a graphic printing business, digitizing client records, payments, products, and quotations. The platform provides better business control through a login system, database, and centralized web access.",
    "portfolioTitle": "Web Portfolio",
    "portfolioDesc": "Personal web portfolio developed with Angular and TypeScript, featuring GSAP animations and practical application of my knowledge in modern web development, design best practices, and user experience.",
    "comingSoon": "More projects coming soon..."
  },
  "contact": {
    "title": "Contact",
    "name": "Name...",
    "email": "Email...",
    "message": "Message...",
    "btn": "Send message",

    "errorName": "Name is required",
    "errorEmail": "Enter a valid email",
    "errorMessage": "Message is required",

    "navHome": "Home",
    "navAbout": "About",
    "navProjects": "Projects",
    "navContact": "Contact",

    "footer": "Web Developer"
  }
}